{
    "id": 13931,
    "date": "2018-10-31T10:34:33",
    "date_gmt": "2018-10-31T05:04:33",
    "guid": {
        "rendered": "https://www.manipalthetalk.org/?p=13931"
    },
    "modified": "2018-10-31T10:34:42",
    "modified_gmt": "2018-10-31T05:04:42",
    "slug": "youth-parliament-2018",
    "status": "publish",
    "type": "post",
    "link": "https://www.manipalthetalk.org/mit/youth-parliament-2018/",
    "title": {
        "rendered": "Youth Parliament: The 2019 Election"
    },
    "content": {
        "rendered": "<h2>The NDA Side</h2>\n\n<p>On 20th October, NLH 105 witnessed an array of young, determined faces who came together to formulate a campaigning strategy for NDA on the upcoming 2019 elections. The discussion commenced with each member giving their basis for the election campaigning. Some members like Narendra Modi (Sreeram Warrier) and Rajnath Singh (Prashant Rao) spoke on the overall development of the nation, while others like Yogi Adityanath (Adithya Das) focused on their state. There were a few conflicts for the foundation plan of the strategy.<br/>The moderate caucus started with the discussion of important aspects such as tax reforms, and gender equality. They focused on generating incentives for the growth of start-ups. Mr Singh also talked about cutting subsidies on various goods and services, which was received critically by the other party.<br/>Amit Shah (Manasvi Sharma) insisted on providing loans to the farmers and<br/>other underprivileged sections of the society. Gender equality was given the<br/>utmost importance as both Modi and Singh spoke on this with interest and zeal. Another conflict arose when Modi proposed Malala Yousafzai as the face of the #MeToo movement.</p>\n\n<p>The dialogue took a new turn when the first crisis came along. The NDA came into full attack when Priyanka Gandhi was accused of sexual assault. They gave a press release—demanding that she abdicate her position in the UPA. The committee meeting went smoothly as they handled further crisis situations with calm and composure. Soon, the &#8216;Safed Holi&#8217; crisis hit the party—where the users of NAMO website were redirected to an adult website. The party collectively expressed this problem as a security breach and promised to look into it. The third crisis became debatable as the members disagreed with the poll results.</p>\n\n<p>Despite smooth sailing and having a stronger hand over its opposition, the NDA dodged its party notions, including Hindutva. They did not delve into religious issues or the political instability in Kashmir. Their manifesto focused on neutral topics, such as deforestation. There were a few blunders committed by the members. Venkaiah Naidu (Mankaran) unknowingly criticized his party for improper execution of the afforestation policies.<br/>The two-day session came to a pleasant end with both the delegates and the EB being content with the proceedings. On the whole, the NDA was able to show professionalism and maturity in its working.<br/></p>\n\n<div class=\"wp-block-cover-image has-background-dim\" style=\"background-image:url(https://manipalthetalk.org/wp-content/uploads/2018/10/YP-3.jpeg)\"></div>\n\n<h2>The UPA Side</h2>\n\n<p>Just beside 105, room number 104 of NLH also saw a plethora of enthusiastic faces, ready to form strategies for the UPA regarding the 2019 General Elections. The discussion started healthily right off the bat with Rahul Gandhi (Sunay Mehta) taking charge. At the very beginning, he declared that the UPA, believing in its pro-democratic agenda, won&#8217;t disclose the Prime Ministerial candidate until they win the elections.<br/>Topics like mass education, youth empowerment, and feminism were discussed. From there, the discussion became increasingly repetitive until the crisis came along. </p>\n\n<p>Priyanka Gandhi, the face of their women empowerment campaign, was accused of sexual assault. The allegations were called ‘completely baseless’ by the UPA and they, in turn, accused the NDA of coming up with them. Priyanka Gandhi did not step down, and no internal inquiry was set up either. It seemed rather hypocritical of the UPA to use the #MeToo movement as a part of their campaign, which is supposed to give victims a voice, and at the same time completely ignore these allegations. When questioned about it, Rahul Gandhi answered, “Priyanka Gandhi is part of the biggest rural campaign movement, and we can&#8217;t remove her right now because that movement will be affected. Also, resigning right now would mean that she&#8217;d be bending down to these false allegations.”<br/>The Rafale deal was brought up much later and was left pretty much undiscussed, and recent issues like the Gujarat migrant exodus weren&#8217;t even brought up.</p>\n\n<p>Overall, by the end of the first day it was pretty clear that the UPA was at a<br/>disadvantage. The NDA&#8217;s upper hand became even more prominent after Shashi Tharoor (Priyam Basu) was convicted for the murder of his wife. A desperate UPA started looking for radical measures, when Rahul Gandhi suggested they instigate instability in Kashmir and blame it on the BJP. P. Chidambaram (CV Mehar) was the only one to stand against this idea bringing a bit of colour to the committee. When Salman Khurshid (Avishad Verma), who supported Rahul Gandhi, was asked how he morally justified this rough measure being a Muslim leader, his answer didn&#8217;t please anyone. The discussion ended with Abhishek Malakar (EB) asking the UPA to introspect and remember their roots.</p>\n\n<h2>Verdict</h2>\n\n<p>With no surprise, the NDA recorded a landslide victory, thanks to the<br/>dynamic duo of Modi and Shah. Manasvi Sharma secured the prize of the best delegate for his extensive research and excellent points in the manifesto. Sreeram Warrier stood by his side, as he won the special mention for leading the party with utmost confidence and his bold speeches. On the UPA side, things didn&#8217;t exactly go as smoothly, but Sunay Mehta stood out for relevantly shaping the discussion, winning him the Best Delegate award. CV Mehar, on the other hand, was acknowledged with a special mention as his reasoning and eloquence resulted in an exciting conflict inside the committee. The event concluded with content faces, and a revived zest for diplomacy, thanks to the EB members and everyone involved.</p>\n\n<p>~  <em><strong>Alankriti Singh</strong></em> and <em><strong>Chintan Gandhi</strong></em> for <strong>MTTN</strong></p>\n\n<p>~ Photographs by <em><strong>Kevin Philip</strong></em> and <em><strong>Suprateek Basu</strong></em></p>\n",
        "protected": false
    },
    "excerpt": {
        "rendered": "<p>The NDA Side On 20th October, NLH 105 witnessed an array of young, determined faces who came together to formulate a campaigning strategy for NDA on the upcoming 2019 elections. The discussion commenced with each member giving their basis for the election campaigning. Some members like Narendra Modi (Sreeram Warrier) and Rajnath Singh (Prashant Rao)&#8230; <a class=\"more-link\" href=\"https://www.manipalthetalk.org/mit/youth-parliament-2018/#more-13931\">Continue Reading &rarr;</a></p>\n",
        "protected": false
    },
    "author": 308,
    "featured_media": 13986,
    "comment_status": "open",
    "ping_status": "open",
    "sticky": false,
    "template": "",
    "format": "standard",
    "meta": {
        "amp_status": ""
    },
    "categories": [
        188,
        5
    ],
    "tags": [
        1693,
        1665,
        1692,
        1694,
        1695,
        727
    ],
    "better_featured_image": {
        "id": 13986,
        "alt_text": "",
        "caption": "",
        "description": "",
        "media_type": "image",
        "media_details": {
            "width": 1080,
            "height": 720,
            "file": "2018/10/YP.jpeg",
            "sizes": {
                "thumbnail": {
                    "file": "YP-150x150.jpeg",
                    "width": 150,
                    "height": 150,
                    "mime-type": "image/jpeg",
                    "source_url": "https://i2.wp.com/www.manipalthetalk.org/wp-content/uploads/2018/10/YP.jpeg?resize=150%2C150&ssl=1"
                },
                "medium": {
                    "file": "YP-300x200.jpeg",
                    "width": 300,
                    "height": 200,
                    "mime-type": "image/jpeg",
                    "source_url": "https://i2.wp.com/www.manipalthetalk.org/wp-content/uploads/2018/10/YP.jpeg?fit=300%2C200&ssl=1"
                },
                "medium_large": {
                    "file": "YP-768x512.jpeg",
                    "width": 768,
                    "height": 512,
                    "mime-type": "image/jpeg",
                    "source_url": "https://www.manipalthetalk.org/wp-content/uploads/2018/10/YP-768x512.jpeg"
                },
                "large": {
                    "file": "YP-1024x683.jpeg",
                    "width": 1024,
                    "height": 683,
                    "mime-type": "image/jpeg",
                    "source_url": "https://i2.wp.com/www.manipalthetalk.org/wp-content/uploads/2018/10/YP.jpeg?fit=736%2C491&ssl=1"
                },
                "wp_review_large": {
                    "file": "YP-320x200.jpeg",
                    "width": 320,
                    "height": 200,
                    "mime-type": "image/jpeg",
                    "source_url": "https://i2.wp.com/www.manipalthetalk.org/wp-content/uploads/2018/10/YP.jpeg?resize=320%2C200&ssl=1"
                },
                "wp_review_small": {
                    "file": "YP-65x65.jpeg",
                    "width": 65,
                    "height": 65,
                    "mime-type": "image/jpeg",
                    "source_url": "https://i2.wp.com/www.manipalthetalk.org/wp-content/uploads/2018/10/YP.jpeg?resize=65%2C65&ssl=1"
                },
                "baskerville-2-post-thumbnail": {
                    "file": "YP-600x400.jpeg",
                    "width": 600,
                    "height": 400,
                    "mime-type": "image/jpeg",
                    "source_url": "https://i2.wp.com/www.manipalthetalk.org/wp-content/uploads/2018/10/YP.jpeg?fit=600%2C400&ssl=1"
                }
            },
            "image_meta": {
                "aperture": "0",
                "credit": "",
                "camera": "",
                "caption": "",
                "created_timestamp": "0",
                "copyright": "",
                "focal_length": "0",
                "iso": "0",
                "shutter_speed": "0",
                "title": "",
                "orientation": "0",
                "keywords": []
            }
        },
        "post": null,
        "source_url": "https://www.manipalthetalk.org/wp-content/uploads/2018/10/YP.jpeg"
    },
    "_links": {
        "self": [
            {
                "href": "https://manipalthetalk.org/wp-json/wp/v2/posts/13931"
            }
        ],
        "collection": [
            {
                "href": "https://manipalthetalk.org/wp-json/wp/v2/posts"
            }
        ],
        "about": [
            {
                "href": "https://manipalthetalk.org/wp-json/wp/v2/types/post"
            }
        ],
        "author": [
            {
                "embeddable": true,
                "href": "https://manipalthetalk.org/wp-json/wp/v2/users/308"
            }
        ],
        "replies": [
            {
                "embeddable": true,
                "href": "https://manipalthetalk.org/wp-json/wp/v2/comments?post=13931"
            }
        ],
        "version-history": [
            {
                "count": 7,
                "href": "https://manipalthetalk.org/wp-json/wp/v2/posts/13931/revisions"
            }
        ],
        "predecessor-version": [
            {
                "id": 13994,
                "href": "https://manipalthetalk.org/wp-json/wp/v2/posts/13931/revisions/13994"
            }
        ],
        "wp:featuredmedia": [
            {
                "embeddable": true,
                "href": "https://manipalthetalk.org/wp-json/wp/v2/media/13986"
            }
        ],
        "wp:attachment": [
            {
                "href": "https://manipalthetalk.org/wp-json/wp/v2/media?parent=13931"
            }
        ],
        "wp:term": [
            {
                "taxonomy": "category",
                "embeddable": true,
                "href": "https://manipalthetalk.org/wp-json/wp/v2/categories?post=13931"
            },
            {
                "taxonomy": "post_tag",
                "embeddable": true,
                "href": "https://manipalthetalk.org/wp-json/wp/v2/tags?post=13931"
            }
        ],
        "curies": [
            {
                "name": "wp",
                "href": "https://api.w.org/{rel}",
                "templated": true
            }
        ]
    }
}